MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F512L.atdf
      <value-group caption="Channel Destination Start Address bits" name="DCH2DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH3DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH4DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH5DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH6DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH7DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="2" />
         <value caption="Physical start address 0xffffffff" name="" value="4294967295" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH0SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH1SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH2SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH3SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH4SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH5SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH6SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH7SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH0DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
