MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F512L.atdf
      <value-group caption="Output Compare Mode Select bits" name="OC5CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin disabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC5CON__OCTSEL">
         <value caption="Timer3 is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timer2 is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC5CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC5CON__OC32">
         <value caption="OCxR(31-0) and/or OCxRS(31-0) are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR(15-0) and OCxRS(15-0) are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC5CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC5CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01095" name="OSC" version="2">
      <register-group name="OSC">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4" initval="0x01200000">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="USB FRC Clock Enable bit" mask="0x00000004" name="UFRCEN" values="OSCCON__UFRCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="PLL Lock Status bit" mask="0x00000020" name="SLOCK" values="OSCCON__SLOCK" />
            <bitfield caption="USB PLL Lock Status bit" mask="0x00000040" name="ULOCK" values="OSCCON__ULOCK" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Phase-Locked Loop (PLL) Multiplier bits" mask="0x00070000" name="PLLMULT" values="OSCCON__PLLMULT" />
            <bitfield caption="Peripheral Bus Clock (PBCLK) Divisor bits" mask="0x00180000" name="PBDIV" values="OSCCON__PBDIV" />
            <bitfield caption="Secondary Oscillator (SOSC) Ready Indicator bit" mask="0x00400000" name="SOSCRDY" values="OSCCON__SOSCRDY" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
            <bitfield caption="Output Divider for PLL" mask="0x38000000" name="PLLODIV" values="OSCCON__PLLODIV" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
      </register-group>
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC(2:0) bits" name="ON" value="0x1" />
         <value caption="Oscillator switch is complete" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB FRC Clock Enable bit" name="OSCCON__UFRCEN">
         <value caption="Enable FRC as the clock source for the USB clock source" name="FRC_EN" value="0x1" />
         <value caption="Use the Primary Oscillator or USB PLL as the USB clock source" name="FRC_DIS" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="DET" value="0x1" />
         <value caption="No clock failure has been detected" name="NO_DET" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="ENABLE" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="PLL Lock Status bit" name="OSCCON__SLOCK">
         <value caption="PLL module is in lock or PLL module start-up timer is satisfied" name="IN_LOCK" value="0x1" />
         <value caption="PLL module is out of lock" name="OUT_LOCK" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Lock Status bit" name="OSCCON__ULOCK">
         <value caption="Indicates that the USB PLL module is in lock or USB PLL module start-up timer is satisfied" name="IN_LOCK" value="0x1" />
         <value caption="Indicates that the USB PLL module is out of lock or USB PLL module start-up timer is in progress or USB PLL is disabled" name="OUT_LOCK" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are locked / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="ON" value="0x1" />
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are not locked and may be modified / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Internal Fast RC Oscillator (FRC) divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC Oscillator (FRC) divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator with PLL module (XTPLL/HSPLL/ECPLL)" name="PRIPLL" value="0x3" />
         <value caption="Primary Oscillator (XT/HS/EC)" name="PRI" value="0x2" />
         <value caption="Internal Fast Internal RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast Internal RC Oscillator (FRC)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Internal Fast RC (FRC) Oscillator divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator (POSC) with PLL module (XTPLL/HSPLL/ECPLL)" name="POSC_PLL" value="0x3" />
         <value caption="Primary Oscillator (POSC) (XT/HS/EC)" name="POSC" value="0x2" />
         <value caption="Internal Fast RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator" name="FRC" value="0x0" />
      </value-group>
